In [95]:
import numpy as np

In [96]:
import pandas as pd

In [97]:
d = {
  "A": [1, 2, np.nan],
  "B": [5, np.nan, np.nan],
  "C": [1, 2, 3]
}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [98]:
df = pd.DataFrame( data=d)

In [99]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [100]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [101]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [102]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [103]:
df.fillna("NONE")

      A     B  C
0   1.0   5.0  1
1   2.0  NONE  2
2  NONE  NONE  3

In [105]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [109]:
df['A'].fillna(value=df['A'].mean()) #preencher com a media

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64